Repository: digitalfox/pysql
Catalog: po/*/pysql.po
Languages: fr

source: If no arg is provided, edits last SQL statement
fr: Si aucun argument n'est donné, la dernière requête SQL est utilisée

source: Well, it seems rather explicit, isn't it?
fr: Et bien, cela semble plutôt explicite non ?

source: <sql statement>
fr: <ordre sql>

source: Computes and displays explain plan for the statement
fr: Calcule et affiche le plan d'exécution de la requête SQL

source: <key>
fr: <clef>

source: Prints the value of the parameter <key>
fr: Affiche la valeur du paramètre <key>

source: The special key « all » allows to print all parameters
fr: Le paramètre spécial « all » permet d'afficher tous les paramètres

source: <pysql command>
fr: <commande pysql>

source: Brings some help like usage and a short description
fr: Affiche l'aide et une courte description

source: about the command and its parameters
fr: sur les commandes et leurs paramètres

source: Without any argument, prints the last 20 commands
fr: Sans argument, affiche les 20 dernières commandes

source: If argument is supplied, executes the nth command
fr: Si un argument est donné, exécute la nième commande

source: <number of lines>
fr: <nombre de lignes>

source: Fetches all lines of current result set and display only the last lines
fr: Récupère toutes les lignes de la requête et affiche uniquement les dernières

source: Default number of lines default to cursor array size
fr: Le nombre de ligne par défaut est celui du paramètre « fetchsize »

source: <path>
fr: <emplacement>

source: Changes working directory
fr: Change le dossier de travail

source: <sqlName> <sqlText>
fr: <nom de la requête> <code sql>

source: Handles user custom sql library. Allows user to save and recall sql requests.
fr: Permet à chacun de se constituer une bibliothèque de requêtes. Il est possible de stocker et rappeler des requêtes SQL.

source: Sample usages:
fr: Exemples d'utilisation :

source: To see all saved request:
fr: Pour afficher toutes les requêtes :

source: To save a request as 'employeeNumber':
fr: Pour enregistrer une requête avec pour étiquette « nombreEmployé »

source: employeeNumber select count(*) from employee
fr: nombreEmployé select count(*) from employee

source: recall a saved request:
fr: Pour afficher toutes les requêtes

source: employeNumber
fr: nombreEmployé

source: To remove the foo request:
fr: Pour supprimer la requête toto :

source: foo remove
fr: toto remove

source: [path/][file]
fr: [emplacement/][fichier]

source: Lists directory contents
fr: Affiche le contenu d'un dossier

source: Displays the locked objects
fr: Affiche les objets verrouillés

source: Prints local directory
fr: Affiche le dossier courant

source: Fetches the n next lines of current result set
fr: Récupère les n prochaines lignes du résultat de la requête

source: Just press enter is equivalent to next without arguments
fr: Appuyez sur la touche entrée est équivalent à la commande « next » sans aucun argument

source: Executes a PL/SQL script and displays the output on the standard output
fr: Exécute un script PL/SQL et affiche le résultat sur la sortie standard

source: <key>=<value>
fr: <clef>=<valeur>

source: Sets <value> to the parameter <key>
fr: Affiche la valeur du paramètre <key>

source: <command line>
fr: <ligne de commande>

source: Executes a command into the system terminal (depending on your system profile)
fr: Exécute une commande système dans le terminal (ceci dépend du votre profil système)

source: If no commands are given then a subshell is openned
fr: Si aucune commande n'est fournie, alors une invite de commande est ouverte

source: Displays the database service name (DSN) of the current connection
fr: Affiche le nom de service de la base de donnée (DSN) de la connexion actuelle

source: Displays the database server version
fr: Affiche la version du serveur de base de données

source: <partial parameter name>
fr: <nom partiel de paramètre>

source: Looks for session parameters with name like the partial name given.
fr: Recherche des paramètres de session dont le nom correspond au nom partiel donné.

source: Wilcard % can be used.
fr: Le joker % peut être utilisé.

source: If none is provided, pysql adds a % at the begining and the end.
fr: Si aucun % n'est fourni, pysql ajoute un % au début et à la fin.

source: Looks for server parameters with name like the partial name given.
fr: Recherche des paramètres du serveur dont le nom correspond au nom partiel donné.

source: These parameters are defined in spfile. Wilcard % can be used.
fr: Ces paramètres sont définis dans le fichier spfile. Le joker % peut être utilisé.

source: Commits pending transaction
fr: Valide la transaction en cours

source: Cancels pending transaction
fr: Annule la transaction en cours

source: Shuts instance down
fr: Arrête l'instance

source: Starts instance up
fr: Démarre l'instance

source: <sql query>
fr: <requête sql>

source: Time request execution time
fr: Chronomètre le temps d'exécution

source: <pysql command or sql order>
fr: <commande pysql ou requête sql>

source: Repeats the command each n seconds
fr: Répète la commande toutes les n secondes

source: If n is ommited, repeat each 3 seconds
fr: Si n est omis, alors répète la commande toutes les 3 secondes

source: Writes configuration to disk
fr: Écriture du fichier de configuration sur le disque

source: Path is $HOME/.pysql/pysqlrc on Unix, %APPDATA%/pysql/pysqrc on Windows
fr: Le chemin est $HOME/.pysql/pysqlrc pour Unix et %APPDATA%/pysql/pysqlrc pour Windows

source: This command takes no argument
fr: Cette commande ne prend aucun argument

source: %s <search pattern on %s name>
fr: %s <motif de recherche pour %s>

source: Looks for %s which match the search pattern
fr: Recherche les objets de type %s dont le nom correspond au motif

source: Wilcard % and boolean operators (and/or) can be used.
fr: Le joker % et les opérateurs booléens (and/or) peuvent être utilisés.

source: If a single word and no % is provided, pysql adds a % at the begining and the end
fr: Si un simple mot et aucun % ne sont fournis, PySQL ajoute un % au début et à la fin

source: Ex. : %s FOO or (BAR%% and %%TEST%%)
fr: Ex. : %s FOO ou (BAR%% et %%TEST%%)

source: Invalid connection string
fr: Chaîne de connexion incorrecte.

source: Pysql - Not connected
fr: Pysql - Non connecté

source: (some columns have been shrinked to fit your terminal size)
fr: (certaines colonnes ont été tronquées pour convenir à la taille de votre écran)

source: Not connected to Oracle
fr: Non connecté à Oracle

source: Invalid argument. Use help <command name> for usage
fr: Argument incorrect. Tapez « help <nom de la commande> » pour avoir de l'aide.

source: Invalid syntax for argument checking
fr: Syntaxe incorrecte pour le contrôle des arguments

source: SQL command is too short
fr: La commande SQL est trop courte

source: Background query launched
fr: Requête en arrière plan lancée

source: Unknown output type!
fr: Format de sortie inconnu !

source: line(s) inserted
fr: ligne(s) insérée(s)

source: line(s) updated
fr: ligne(s) mise(s) à jour

source: line(s) deleted
fr: ligne(s) supprimée(s)

source: (press enter to see next results)
fr: (appuyez sur entrer pour voir les prochains résultats)

source: Error sum up
fr: Résumé des erreurs

source: Error message
fr: Message d'erreur

source: Oracle error Code
fr: Code d'erreur Oracle

source: Bye !
fr: Au revoir !

source: Specify the number of days of snapshots to choose from:
fr: Précisez l'âge des snapshots à choisir (en jours) :

source: Invalid number of days
fr: Nombre de jours invalide

source: Enter %s snapshot identifier:
fr: Saisissez l'identifiant du snapshot de %s :

source: Invalid snaphsot id
fr: Identifiant de snapshot invalide.

source: Available releases : %s
fr: Versions disponibles : %s

source: Latest is %s
fr: La dernière est %s

source: Current is %s
fr: La version actuelle est %s

source: You are in snapshot release - move to last [r]elease or last [s]napshot (r/s) ?
fr: Vous êtes en version de développement (snapshot). Voulez-vous basculer sur une version officielle ([r]elease) ou rester en version de développement ([s] snapshot) (r/s) ?

source: A new release is available (%s). Do you want to update (y/n) ?
fr: Une nouvelle version est disponible (%s). Souhaitez-vous effectuer la mise à jour (y/n) ?

source: Ok, bye
fr: Ok. Au revoir

source: PySQL is up to date. No need to update
fr: Vous disposez déjà de la dernière version de PySQL. Aucune mise à jour n'est nécessaire

source: Cannot reach PySQL Website (%s)
fr: Impossible de contacter le site web de PySQL (%s)

source: Unable to read 'version' file. Do you remove or change it ?
fr: Impossible de lire le fichier « version ». A-t-il été modifié ou supprimé ?

source: =>update to version %s<=
fr: => Mise à jour vers la version %s <=

source: Cannot remove previous aborted update. Please remove it by hand (%s)
fr: Impossible de supprimer la précédente installation en échec. Supprimez la manuellement (%s)

source: Downloading from PySQL Website...
fr: Téléchargement depuis le site de PySQL...

source: Done !
fr: Fait !

source: Opening archive and copying files to pysql directory...
fr: Ouverture de l'archive et copie des fichiers dans le répertoire de PySQL...

source: Failed to download file from PySQL WebSite (%s)
fr: Échec du téléchargement du fichier depuis le site web de PySQL (%s)

source: Cannot write archive file to %s (%s)
fr: Impossible d'écrire le fichier d'archive dans %s (%s)

source: Cannot remove %s (%s)
fr: Impossible de supprimer %s (%s)

source: Cleanup...
fr: Nettoyage...

source: Update successul !
fr: Mise à jour réussie !

source: Error while copying files (%s)
fr: Erreur lors de la copie des fichiers (%s)

source: Bad release scheme (%s)
fr: Mauvais modèle de version (%s)

source: Cannot compare with snapshot release
fr: Impossible de comparer avec une version de développement
