Repository: digitalfox/pysql
Catalog: po/*/pysql.po
Languages: fr

source: Insufficient privileges
fr: Privilèges insuffisants

source: Invalid snapshot pair: (%s ; %s)
fr: Couple de snapshots invalide : (%s ; %s)

source: #Cols
fr: NbCols

source: #Rows
fr: NbLig

source: Size(%)
fr: Taille(%)

source: Size(MB)
fr: Taille(Mo)

source: Size(blk)
fr: Taille(blc)

source: Owner
fr: Propriétaire

source: Keys
fr: Clés

source: Level
fr: Niv

source: Internal error: type %s not supported
fr: Erreur interne: type %s non géré

source: Table %s does not exist
fr: La table %s n'existe pas

source: Allocated
fr: Alloués

source: Lost
fr: Perdus

source: Lost(%)
fr: Perdus(%)

source: Needed
fr: Nécessaires

source: Name
fr: Nom

source: Using config file %s
fr: Utilisation du fichier de configuration %s

source: Failed to create personnal configuration file
fr: Échec lors de la création du fichier de configuration

source: (Config file created)
fr: (Fichier de configuration créé)

source: Sorry, value %s is not valid for parameter %s
fr: Désolé, la valeur %s est incorrecte pour le paramètre %s

source: Cannot set config, no configParser exist !
fr: Impossible d'enregistrer la configuration, aucun configParser n'existe !

source: (config file saved successfully)
fr: (fichier de configuration enregistré avec succès)

source: fail to write file: %s
fr: échec lors de l'écriture du fichier : %s

source: (no need to save)
fr: (rien à enregistrer)

source: Fail to save completion cache to %s. Error was: %s
fr: Échec lors de l'enregistrement du cache dans %s. L'erreur est : %s

source: Fail to save user sql library to %s. Error was: %s
fr: Échec lors de l'enregistrement de la bibliothèque de requête de l'utilisateur dans %s. L'erreur est : %s

source: Fail to save history to %s. Error was: %s
fr: Échec lors de l'enregistrement de l'historique dans %s. L'erreur est : %s

source: Connected to an idle instance
fr: Connecté à une instance inactive

source: Cannot connect to Oracle: %s
fr: Impossible de se connecter à Oracle : %s

source: Your Oracle and/or cx_Oracle version is too old to support startup option
fr: Votre version d'Oracle et/ou de cx_Oracle est trop ancienne pour la commande startup

source: Cannot start instance up: %s
fr: Impossible de démarrer l'instance : %s

source: Your Oracle and/or cx_Oracle version is too old to support shutdown option
fr: Votre version d'Oracle et/ou de cx_Oracle est trop ancienne pour la commande shutdown

source: Cannot shut instance down: %s
fr: Impossible d'arrêter l'instance : %s

source: Cannot commit: %s
fr: Impossible de valider les modifications (commit) : %s

source: Cannot rollback: %s
fr: Impossible d'annuler les modifications (rollback) : %s

source: Cannot execute query: %s
fr: Impossible d'exécuter la requête : %s

source: Can only validate DML queries
fr: Seules les requêtes DML peuvent être validées.

source: Cannot validate query: %s
fr: Impossible de valider la requête : %s

source: No result set. Execute a query before fetching result !
fr: Aucun résultat. Exécutez une requête avant d'en demander les résultats !

source: Error while fetching results: %s
fr: Erreur lors de la récupération des résultats : %s

source: Cannot close connection: %s
fr: Impossible de fermer la connexion : %s

source: Cannot encode data, not connected to Oracle
fr: Impossible d'encoder les données, vous n'êtes pas connecté à Oracle

source: string '%s' is already encoded
fr: La chaîne « %s » est déjà encodée

source: Got unicode error while encoding '%s'
fr: Erreur unicode lors de l'encodage de « %s »

source: Warning, string '%s' is already Unicode
fr: Avertissement, la chaîne « %s » est déjà en unicode

source: Can't decode '%s' with %s codec. Check your NLS_LANG variable
fr: Impossible de décoder « %s » avec l'encodage « %s ». Vérifiez votre variable NLS_LANG

source: Cannot decode %s object
fr: Impossible de décoder l'objet %s

source: None
fr: Aucune

source: Not yet implemented
fr: Non encore implémenté.

source: Action denied: %s
fr: Action non permise : %s

source: Too much synonym recursion
fr: Trop d'imbrication de synonymes

source: Cannot count rows of such object : %s
fr: Impossible de compter les enregistrements d'un tel objet : %s

source: unknown diff control caracter (%s)
fr: Caractère de contrôle de différence inconnu (%s)

source: Could not find table %s
fr: Impossible de trouver la table %s

source: %s does not seem to be a table in %s
fr: % ne semble pas être une table dans %s

source: Unable to compare data of tables that do not have same structure (columns name and type)
fr: Impossible de comparer les données de tables qui ne possèdent pas la même structure (nom et type des colonnes)

source: Got multiple result:
fr: Plusieurs résultats obtenus :

source: Defaulting to own object: %s
fr: Utilisation de l'objet propre à l'utilisateur : %s

source: Defaulting to public object: %s
fr: Utilisation de l'objet public : %s

source: Status
fr: Statut

source: Comment
fr: Commentaires

source: <unable to get comment>
fr: <impossible d'afficher le commentaire>

source: Created on
fr: Création

source: <unable to get date of creation>
fr: <impossible d'obtenir la date de création>

source: Last DDL on
fr: Dernier DDL

source: <unable to get date of last DDL modification>
fr: <impossible d'obtenir la date de dernière modification>

source: Last analyzed on
fr: Dernière analyse

source: Nb rows
fr: Nb de lignes

source: Nb used blocks
fr: Nb de blocs utilisés

source: Avg row length
fr: Long. moyenne de ligne

source: Comments
fr: Commentaires

source: Indexes
fr: Index

source: %Used
fr: Utilisation (%)

source: Free (%s)
fr: Libre (%s)

source: Size (%s)
fr: Taille (%s)

source: Target
fr: Cible

source: Path
fr: Chemin

source: Property
fr: Propriété

source: Value
fr: Valeur

source: Last
fr: Dernier

source: Max
fr: Maximum

source: Min
fr: Minimum

source: Step
fr: Pas

source: Body
fr: Corps

source: Event
fr: Événement

source: #Indexes
fr: NbIndex

source: #Tables
fr: NbTables

source: Default?
fr: Défaut?

source: Type not handled: %s
fr: Type non géré : %s

source: No editors are supported on this platform. Sorry.
fr: Aucun éditeur n'est supporté sur cette plate-forme. Désolé.

source: Editor exited with status %s
fr: L'éditeur est sortie avec le code retour : %s

source: Error while using temporary file (%s)
fr: Erreur lors de l'utilisation du fichier temporaire (%s)

source: OS user
fr: Utilisateur OS

source: Object
fr: Objet

source: User
fr: Utilisateur

source: Logged Since
fr: Depuis

source: OsUser
fr: Utilisateur

source: Program
fr: Programme

source: Schema
fr: Schéma

source: System?
fr: Système?

source: Used?
fr: Utilisé ?

source: SQL entry not defined for searchObjectSql: %s
fr: Aucune entrée SQL définie dans le tableau searchObjectSql : %s

source: Function not available because pydot module is not installed.
fr: Fonction non disponible car le module pydot n'est pas installé.

source: Go to http://dkbza.org/pydot.html to get it.
fr: Allez sur le site http://dkbza.org/pydot.html pour l'obtenir.

source: No table found. Your filter clause is too restrictive or the schema is empty
fr: Aucune table trouvée. La clause de filtrage est trop restrictive ou alors le schéma est vide

source: Extracting %d tables...
fr: Extraction de %d tables...

source: Extracting %d links...
fr: Extraction de %d liens...

source: Warning: reach max node, references lookup stopped on direction %s
fr: Avertissement : le nombre maximal de noeuds a été atteint, la résolution des références a été arrêtée pour la direction %s

source: Warning: reach max recursion limit, references lookup stopped on direction %s
fr: Avertissement : la limite de récursivité a été atteinte, la résolution des références a été arrêtée pour la direction %s

source: Extracting %3d tables from tablespace %s
fr: Extraction de %3d tables du tablespace %s

source: Warning: table "%s" removed because no statistics have been found
fr: Avertissement : la table « %s » a été retirée de la liste car elle ne possède pas de statistique

source: Warning: table "%s" removed because it is empty
fr: Avertissement : la table « %s » a été retirée de la liste car elle ne possède pas d'enregistrement

source: Extracting %3d indexes from tablespace %s
fr: Extraction de %3d index du tablespace %s

source: Warning: index "%s" removed because no statistics have been found
fr: Avertissement : l'index « %s » a été retiré de la liste car il ne possède pas de statistique.

source: Warning: index "%s" removed because it is empty
fr: Avertissement : l'index « %s » a été retiré de la liste car il ne possède pas de données

source: Not extracting indexes from tablespace %s (ignored)
fr: Pas d'extraction d'index du tablespace %s (ignoré)

source: Displaying %3d tables for tablespace %s
fr: Extraction de %3d tables du tablespace %s

source: Displaying %3d indexes for tablespace %s
fr: Extraction de %3d indexes du tablespace %s

source: This is not a package or package not found
fr: Ceci n'est pas un paquet (package) ou alors le paquet n'a pas été trouvé

source: Extracting package source...
fr: Extraction de sources du paquet...

source: Parsing source and building graph...
fr: Analyse de la source et construction du graphe...

source: This package does not have any readable function or procedure
fr: Ce paquet ne contient aucune fonction ou procédure exploitable

source: Viewer was not found
fr: Afficheur non trouvé

source: Generating picture using %s filter...
fr: Génération de l'image avec le filtre %s...

source: Graphviz failed to generate image: %s
fr: Graphviz n'a pas pu générer l'image : %s

source: Image saved as
fr: Image enregistrée sous

source: Unit not handled: %s
fr: Unité non gérée : %s

source: is not installed. Get it at http://www.graphviz.org/Download.php
fr: n'est pas installé. Vous pouvez le télécharger à http://www.graphviz.org/Download.php

source: Operator %s was not expected at word %s
fr: L'opérateur %s n'était pas attendu au mot %s

source: The ! is not supported before parenthisis
fr: Le point d'exclamation (!) n'est pas autorisé avant une parenthèse

source: Operator (AND/OR) expected at word %s
fr: Un opérateur (AND ou OR) était attendu au mot %s

source: Unblanced parenthisis (%s)
fr: Pas d'équilibre des parenthèses ouvrantes / fermantes (%s)

source: Aborting update
fr: Abandon de la mise à jour

source: (press any key to exit)
fr: (appuyez sur une touche pour quitter)

source: (press enter key to exit)
fr: (appuyez sur une touche pour quitter)

source: Pysql error
fr: Erreur Pysql

source: Cannot get the date of creation on object %s
fr: Impossible d'obtenir la date de création de l'objet %s

source: Cannot get the date of last DDL modification on object %s
fr: Impossible d'obtenir la date de dernière modification de l'objet %s

source: Object type is not defined
fr: Le type de l'objet n'est pas défini

source: Cannot get the comment on object %s
fr: Impossible d'obtenir le commentaire de l'objet %s

source: Data file %s does not exist
fr: Le fichier %s n'existe pas

source: Indexed Columns
fr: Colonnes indexées

source: Unable to resolve system synonyms
fr: Impossible de résoudre les synonymes système

source: SQL code of the view cannot be empty
fr: Le code SQL de la vue ne peut être vide

source: (not connected)
fr: (non connecté)

source: Connection failed: %s
fr: Échec de connexion : %s

source: Break !
fr: Interruption !

source: Welcome to pysql shell
fr: Bienvenue dans pysql

source: Type "help" for some help. Use Tab for completion
fr: Saisissez « help » pour afficher l'aide. Utilisez la touche tabulation pour compléter vos saisies.

source: ==> Unhandled error. Sorry <==
fr: ==> Erreur non gérée. Désolé <==

source: Unknown command or sql order. Type "help" for help
fr: Commande ou ordre SQL inconnu. Saisissez « help » pour afficher l'aide

source: Cannot open tnsnames.ora file (%s)
fr: Impossible d'ouvrir le fichier tnsnames.ora (%s)

source: Error while closing previous connection: %s
fr: Erreur lors de la fermeture de la précédente connexion : %s

source: Invalid Oracle mode: %s (ignored)
fr: Mode Oracle non valable : %s (ignoré)

source: History not available on Windows platform (readline limitation)
fr: La fonction historique n'est pas disponible pour la plate-forme Windows (limitation de la librairie ReadLine)

source: Argument must be an integer
fr: L'argument doit être un entier

source: This is the future ! Cannot execute. Sorry
fr: Ceci est le future ! Rien se sera fait. Désolé.

source: Argument should be stricly positive
fr: L'argument doit être strictement positif

source: See help history for usage
fr: Tapez « help history » pour avoir de l'aide

source: SQL request
fr: Requête SQL

source: SQL request was loaded in your history. Use up arrow to get it now
fr: La requête SQL a été chargée dans votre historique. Utilisez la flèche « haut » pour la récupérer.

source: Request %s does not exist.
fr: La requête %s n'existe pas.

source: Type "lib" without argument to see all requests
fr: Tapez « lib » sans argument pour visualiser toutes les requêtes

source: Request has been removed
fr: La requête a été supprimée

source: Request has been saved
fr: La requête a été enregistrée

source: Error
fr: Erreur

source: Finished?
fr: Terminé ?

source: Statement executed
fr: Ordre exécuté

source: Unknown background query. Use bg without arg to see all queries
fr: Requête en arrière plan inconnue. Utilisez la commande « bg » sans argument pour toutes les voir.

source: See help bg for description
fr: Saisissez « help bg » pour obtenir de l'aide

source: Commit completed
fr: « Commit » réussi

source: Rollback completed
fr: « Rollback » réussi

source: Database mounted
fr: Base de données montée

source: Database opened
fr: Base de données ouverte

source: Instance shut down
fr: Instance arrêtée

source: Cannot compare a table and a schema!
fr: Impossible de comparer une table à un schéma !

source: Tables are identical
fr: Les tables sont identiques

source: Tables found in %s but not in %s
fr: Tables trouvées dans %s mais pas dans %s

source: Tables identical in both schema
fr: Tables identiques aux deux schémas

source: Tables not identical in both schema
fr: Tables différentes dans les deux schémas

source: Table %s differ from schema %s
fr: Différences entre la table %s du schéma %s

source: (marked with "-") and schema %s (marked with "+")
fr: (préfixe "-") et celle du schéma %s (préfixe "+")

source: [options] <object name>
fr: [options] <nom de l'object>

source: Describes any Oracle object
fr: Décrit n'importe quel objet Oracle

source: displays detailed information about the object
fr: affiche les informations détaillées de l'objet

source: displays statistics on the object if any
fr: affiche les statistiques de l'objet s'il y en a

source: sorts column alphabetically instead of Oracle native order
fr: trie les colonnes dans l'ordre alphabétique plutôt que dans l'ordre naturel d'Oracle

source: Generates tuning advice report based on AWR statistics.
fr: Génère les conseils d'optimisation à partir des statistiques de l'AWR.

source: 10g or upper is required.
fr: Requiert la version 10g ou ultérieure.

source: Before starting, please ensure that you have the required license to use it.
fr: Avant de commencer, assurez-vous de posséder la licence nécessaire à son utilisation.

source: level: BASIC | TYPICAL (default) | ALL
fr: niveau : BASIC | TYPICAL (défaut) | ALL

source: begin snapshot identifier
fr: identifiant du snapshot de début

source: end snapshot identifier
fr: identifiant du snapshot de fin

source: output file
fr: fichier de sortie

source: begin
fr: début

source: end
fr: fin

source: Missing arguments. Please, specify snaphsot identifiers.
fr: Arguments manquants. Veuillez précisez les identifiants de snapshots.

source: (Completed)
fr: (Terminé)

source: Generates performance report based on AWR statistics.
fr: Génère un rapport de performance à partir des statistiques de l'AWR.

source: output type: HTML | TEXT (default)
fr: format de sortie : HTML ou TEXT (défaut)

source: [options] <sql statement>
fr: [options] <ordre sql>

source: Generates tuning advice report for an SQL query.
fr: Génère les conseils d'optimisation d'une requête SQL.

source: Generates storage report based on segment statistics.
fr: Génère un rapport sur le stockage à partir des des statistiques des segments.

source: DBA grants are required.
fr: Les permissions DBA sont requises.

source: type of segment: TABLE | INDEX | BOTH (default)
fr: type de segment : TABLE ou INDEX ou BOTH (défaut)

source: filters by tablespace
fr: filtre par tablespace

source: filters by user
fr: filtre par utilisateur

source: filters resultset to the n first rows
fr: filtre les n premières lignes du résultat

source: (1 distinct file per segment type)
fr: (1 fichier distinct par type de segment)

source: [options] [filters on table name]]
fr: [options] [filtres sur les noms de tables]]

source: Extracts the datamodel of a user filtered on selected table pattern.
fr: Extrait le modèle de données d'un schéma filtré par le motif de nom de table spécifié.

source: The generation of the output is powered by Graphviz (http://www.graphviz.org)
fr: La génération du résultat s'appuie sur Graphviz (http://www.graphviz.org)

source: also draws table's columns
fr: dessine également les colonnes des tables

source: user owner of tables (schema)
fr: propriétaire des tables (schéma)

source: Displays object dependencies as a picture.
fr: Affiche les dépendances d'un objet sous forme d'image.

source: direction of dependency tracking: %s
fr: direction de parcours des dépendances

source: maximum level of recursion
fr: Niveau maximum de récursivité

source: maximum number of nodes on graph
fr: nombre maximum de noeuds dans le graphe

source: [options] <schema name>
fr: [options] <nom de schéma>

source: Extracts the physical storage of a user as a picture based on Oracle statistics.
fr: Extrait le stockage physique d'un schéma sous forme d'image à partir des statistiques Oracle.

source: also draws index segment
fr: dessine également les index

source: draws object sizes against others
fr: dessine la taille des objets les uns par rapport aux autres

source: (no result)
fr: (aucun résultat)

source: (Update successful)
fr: (Mise à jour réussie)

source: Incorrect arguments. See help edit
fr: Arguments incorrects. Tapez « help edit »

source: [options] <session id>
fr: [options] <id de session>

source: Displays Oracle sessions.
fr: Affiche les sessions Oracle.

source: If a session id is provided, display detailed session informations,
fr: Si un id de session est fourni, affiche les informations détaillées de cette session.

source: else display all session summary
fr: sinon affiche le résumé de toutes les sessions

source: displays all foreground sessions, both active and inactive
fr: affiche toutes les sessions, actives ou non

source: filters session display with given search term. Multiple searches can be given to make 'and' search
fr: filtre l'affichage de la session selon le terme recherché. Plusieurs recherches peuvent être réalisées en utilisant 'and'

source: Note: the all (-a / --all) option is useless when display one session
fr: Note : l'option all (-a / --all) est inutile pour l'affichage d'une session

source: Input/Output statistics
fr: Statistiques sur les entrées/sorties

source: Wait events
fr: Événements d'attente

source: Current statement
fr: Requête actuelle

source: Cannot explain plan (%s)
fr: Impossible de calculer le plan d 'exécution (%s)

source: No statement
fr: Aucune requête

source: Open cursors
fr: Curseurs ouverts

source: Locks
fr: Verrous

source: <session-id> <session-serial>
fr: [options] <id de session> <serial de session>

source: Kills the session given in parameter.
fr: Détruit la session donnée en paramètre.

source: Uses the 'session' command to find session-id and session-serial (two first columns)
fr: Utilisez la commande session pour trouver le session-id et le session-serial (il s'agit des deux premières colonnes)

source: kills immediatly the current session
fr: tue immédiatement la session courante

source: Kill signal has been sent to the session
fr: La demande de destruction de la session a été faite

source: Input/Output delta for session %s
fr: Variation des entrées/sorties pour la session %s

source: Wait events delta for session %s
fr: Variation des événements d'attente pour la session %s

source: Starting trace capture for session %s
fr: Début de la capture des traces Oracle pour la session %s

source: Type "trace %s" again to stop trace on this sesssion
fr: Tapez « trace %s » de nouveau pour cesser la capture des traces de cette session.

source: Session %s does not exist or you are not allowed to see session details
fr: La session %s n'existe pas ou bien vous n'êtes pas autorisé à en voir les détails.

source: Default value
fr: Valeur par défaut

source: Parameter
fr: Paramètre

source: User defined value
fr: Valeur de l'utilisateur

source: Exited with code
fr: Terminé avec le code

source: No such directory
fr: Dossier non trouvé

source: exit watch
fr: sortie de la fonction watch

source: (Executed in %.1f second(s))
fr: (Exécuté en %.1f seconde(s))

source: Connected to
fr: Connecté à

source: Invalid argument
fr: Argument incorrect

source: <table name>
fr: <nom table>

source: Computes block clustering introduced by Oracle ASSM
fr: Calcule la fragmentation des blocs introduites par l'ASSM d'Oracle

source: [order id]
fr: [id requête]

source: Manages background queries
fr: Gère les requêtes en arrière plan

source: Sample usages:
fr: Exemples d'utilisation :

source: To display all background queries:
fr: Pour afficher toutes les requêtes en arrière plan :

source: To call back a background query:
fr: Pour rappeler une requête en arrière plan :

source: <user>[/<password>@<SID>][:<table>] <user>[/<password>@<SID>][:<table>]
fr: utilisateur[/motdepasse@SID][:table] utilisateur[/motdepasse@SID][:table]

source: Compares structure or data of two schemas or two tables. Objects could be in two distinct databases.
fr: Compare la structure ou les données de deux schémas ou de deux tables. Les objets peuvent être dans deux bases différentes.

source: By default, only structure is compared.
fr: Par défaut, seule la structure est comparée.

source: To compare two schemas:
fr: Pour comparer deux schémas :

source: user/password@SID user/password@SID
fr: utilisateur/motdepasse@SID:table utilisateur/motdepasse@SID:table

source: To compare two tables:
fr: Pour comparer deux tables :

source: user/password@SID:table user/password@SID:table
fr: utilisateur/motdepasse@SID:table utilisateur/motdepasse@SID:table

source: To compare two tables in current schema:
fr: Pour comparer deux tables du même schéma :

source: To compare table data, use the "data" keyword this way:
fr: Pour comparer les données, utilisez le mot clef « data » comme ceci :

source: user[/password][@[host[:port]/]SID]
fr: utilisateur[/mot-de-passe][@[hôte[:port]/]SID]

source: Connects to Oracle and closes previous connection if any
fr: Connecte à Oracle et ferme la précédente connexion si elle existe

source: <table/view name>
fr: <nom table/vue>

source: Counts the number of lines in a table or a view
fr: Compte le nombre de ligne dans une table ou une vue

source: <output file> <sql query>
fr: <fichier de sortie> <requête sql>

source: Dumps sql query to file
fr: Enregistre le résultat d'une requête sql dans un fichier

source: Example:
fr: Exemple :

source: ddl <table|view>
fr: ddl <nom table/vue>

source: Prints Oracle object DDL
fr: Affiche le DDL d'un objet Oracle

source: Closes current connection if any
fr: Ferme la connexion actuelle si elle existe

source: <object name>
fr: <nom de l'object>

source: Edits (view or modify) an object)
fr: Visualise ou modifie un objet
